package com.graphtheory.basic;

public class Main {
    
    //1.最小生成树 最小生成树是一个连通图的一个子图，包含了图中所有的顶点，并且边的权值之和最小。
    // Prim算法  
    // 实现思想：
    // 1.从一个顶点开始，选择与该顶点相连的边中权值最小的边，加入到最小生成树中。   
    // 2.将该边的另一个顶点加入到最小生成树中。
    // 3.重复步骤1和2，直到所有顶点都被加入到最小生成树中。 
 
    //与最短路径算法的区别：
    // 最小生成树是一个连通图的一个子图，包含了图中所有的顶点，并且边的权值之和最小。
    // 最短路径算法是从一个顶点到另一个顶点的路径中，边的权值之和最小。
    // 最小生成树是一个连通图的一个子图，包含了图中所有的顶点，并且边的权值之和最小。


    //2.最短路径算法
    // 最短路径算法是从一个顶点到另一个顶点的路径中，边的权值之和最小。
    // Dijkstra算法
    // 实现思想：
    // 1.从一个顶点开始，选择与该顶点相连的边中权值最小的边，加入到最短路径中。
    // 2.将该边的另一个顶点加入到最短路径中。
    // 3.重复步骤1和2，直到所有顶点都被加入到最短路径中。


    
}
